---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter
source: html/aa5e4d8b-97b7-7a23-864e-f5d3a06bd551.htm
---
# StructuralInstanceUsageFilter Members

Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.